var searchData=
[
  ['механіка_0',['Ігрова механіка',['../md_docs_2documentation__ua.html#autotoc_md45',1,'']]],
  ['механіка_20гри_1',['Механіка гри',['../md_docs_2mechanics__ua.html',1,'']]],
  ['моделювання_20діаграм_20plantuml_2',['Враження від інструменту моделювання діаграм (PlantUML)',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html',1,'']]],
  ['можливості_20доступні_20на_20кожному_20типі_20діаграм_20підтримує_20інструмент_20якщо_20ні_20вкажіть_20що_20саме_20не_20підтримується_20та_20для_20якого_20типу_20діаграм_3',['6. Чи всі можливості, доступні на кожному типі діаграм, підтримує інструмент? Якщо ні - вкажіть, що саме не підтримується, та для якого типу діаграм',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md114',1,'']]],
  ['можливості_20розширення_4',['Можливості розширення',['../md_docs_2documentation__ua.html#autotoc_md56',1,'']]],
  ['можливості_20інструменту_20наприклад_20генерацію_20коду_20з_20діаграм_20чи_20відновлення_20діаграм_20з_20коду_20наскільки_20гарно_20та_20правильно_20працюють_20ці_20можливості_5',['7. Чи використовували якісь додаткові можливості інструменту, наприклад генерацію коду з діаграм чи відновлення діаграм з коду? Наскільки гарно та правильно працюють ці можливості?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md115',1,'']]],
  ['можна_20сказати_20про_20цей_20інструмент_20які_20були_20негативні_20аспекти_20використання_20інструменту_6',['12. Що поганого можна сказати про цей інструмент, які були негативні аспекти використання інструменту?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md120',1,'']]],
  ['можна_20сказати_20про_20цей_20інструмент_20які_20були_20позитивні_20аспекти_20використання_20інструменту_7',['11. Що хорошого можна сказати про цей інструмент, які були позитивні аспекти використання інструменту?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md119',1,'']]]
];
