var searchData=
[
  ['7_20чи_20використовували_20якісь_20додаткові_20можливості_20інструменту_20наприклад_20генерацію_20коду_20з_20діаграм_20чи_20відновлення_20діаграм_20з_20коду_20наскільки_20гарно_20та_20правильно_20працюють_20ці_20можливості_0',['7. Чи використовували якісь додаткові можливості інструменту, наприклад генерацію коду з діаграм чи відновлення діаграм з коду? Наскільки гарно та правильно працюють ці можливості?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md115',1,'']]]
];
