var searchData=
[
  ['9_20наскільки_20зрозумілою_20була_20поведінка_20інструменту_20в_20різних_20ситуаціях_20чи_20не_20виникали_20ситуації_20коли_20незрозуміло_20чому_20були_20виконані_20якісь_20дії_20чи_20як_20досягли_20певного_20стану_0',['9. Наскільки зрозумілою була поведінка інструменту в різних ситуаціях? Чи не виникали ситуації, коли незрозуміло, чому були виконані якісь дії чи як досягли певного стану?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md117',1,'']]]
];
