var searchData=
[
  ['саме_0',['10. Чи виникали якісь проблеми з використанням інструменту? Чи вдалось їх вирішити, як саме?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md118',1,'']]],
  ['саме_20використовувати_20інструмент_20які_20функції_20засоби_20вікна_20або_20елементи_20керування_20використовувати_20для_20вирішення_20поставлених_20задач_1',['4. Наскільки було зрозуміло, як саме використовувати інструмент, які функції, засоби, вікна або елементи керування використовувати для вирішення поставлених задач?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md112',1,'']]],
  ['саме_20не_20підтримуються_2',['5. Чи всі 14 типів діаграм з UML 2.5 підтримує інструмент? Якщо ні - вкажіть, які саме не підтримуються',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md113',1,'']]],
  ['саме_20не_20підтримується_20та_20для_20якого_20типу_20діаграм_3',['6. Чи всі можливості, доступні на кожному типі діаграм, підтримує інструмент? Якщо ні - вкажіть, що саме не підтримується, та для якого типу діаграм',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md114',1,'']]],
  ['саме_20цей_20інструмент_20а_20не_20аналоги_4',['1. Чому було обрано саме цей інструмент, а не аналоги?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md109',1,'']]],
  ['само_20а_20що_20змінити_20якби_20довелось_20виконувати_20аналогічну_20задачу_20ще_20раз_5',['13. Що варто було б робити так само, а що змінити, якби довелось виконувати аналогічну задачу ще раз?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md121',1,'']]],
  ['світу_6',['Система світу',['../md_docs_2documentation__ua.html#autotoc_md35',1,'']]],
  ['система_20бою_7',['Система бою',['../md_docs_2documentation__ua.html#autotoc_md46',1,'']]],
  ['система_20предметів_8',['Система предметів',['../md_docs_2documentation__ua.html#autotoc_md42',1,'']]],
  ['система_20світу_9',['Система світу',['../md_docs_2documentation__ua.html#autotoc_md35',1,'']]],
  ['система_20сутностей_10',['Система сутностей',['../md_docs_2documentation__ua.html#autotoc_md38',1,'']]],
  ['ситуаціях_20чи_20не_20виникали_20ситуації_20коли_20незрозуміло_20чому_20були_20виконані_20якісь_20дії_20чи_20як_20досягли_20певного_20стану_11',['9. Наскільки зрозумілою була поведінка інструменту в різних ситуаціях? Чи не виникали ситуації, коли незрозуміло, чому були виконані якісь дії чи як досягли певного стану?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md117',1,'']]],
  ['ситуації_20коли_20незрозуміло_20чому_20були_20виконані_20якісь_20дії_20чи_20як_20досягли_20певного_20стану_12',['9. Наскільки зрозумілою була поведінка інструменту в різних ситуаціях? Чи не виникали ситуації, коли незрозуміло, чому були виконані якісь дії чи як досягли певного стану?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md117',1,'']]],
  ['сказати_20про_20цей_20інструмент_20які_20були_20негативні_20аспекти_20використання_20інструменту_13',['12. Що поганого можна сказати про цей інструмент, які були негативні аспекти використання інструменту?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md120',1,'']]],
  ['сказати_20про_20цей_20інструмент_20які_20були_20позитивні_20аспекти_20використання_20інструменту_14',['11. Що хорошого можна сказати про цей інструмент, які були позитивні аспекти використання інструменту?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md119',1,'']]],
  ['стану_15',['9. Наскільки зрозумілою була поведінка інструменту в різних ситуаціях? Чи не виникали ситуації, коли незрозуміло, чому були виконані якісь дії чи як досягли певного стану?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md117',1,'']]],
  ['структура_16',['Обсяг коду та структура',['../md_SUMMARY.html#autotoc_md99',1,'']]],
  ['сутностей_17',['Система сутностей',['../md_docs_2documentation__ua.html#autotoc_md38',1,'']]]
];
