var searchData=
[
  ['раз_0',['13. Що варто було б робити так само, а що змінити, якби довелось виконувати аналогічну задачу ще раз?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md121',1,'']]],
  ['реалізації_1',['Технічні деталі реалізації',['../md_docs_2documentation__ua.html#autotoc_md49',1,'']]],
  ['рефакторинг_2',['Звіт про рефакторинг',['../md_SUMMARY.html',1,'']]],
  ['робити_20так_20само_20а_20що_20змінити_20якби_20довелось_20виконувати_20аналогічну_20задачу_20ще_20раз_3',['13. Що варто було б робити так само, а що змінити, якби довелось виконувати аналогічну задачу ще раз?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md121',1,'']]],
  ['розширення_4',['Можливості розширення',['../md_docs_2documentation__ua.html#autotoc_md56',1,'']]],
  ['різних_20ситуаціях_20чи_20не_20виникали_20ситуації_20коли_20незрозуміло_20чому_20були_20виконані_20якісь_20дії_20чи_20як_20досягли_20певного_20стану_5',['9. Наскільки зрозумілою була поведінка інструменту в різних ситуаціях? Чи не виникали ситуації, коли незрозуміло, чому були виконані якісь дії чи як досягли певного стану?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md117',1,'']]]
];
