var searchData=
[
  ['керування_20використовувати_20для_20вирішення_20поставлених_20задач_0',['4. Наскільки було зрозуміло, як саме використовувати інструмент, які функції, засоби, вікна або елементи керування використовувати для вирішення поставлених задач?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md112',1,'']]],
  ['керування_20пам’яттю_1',['Керування пам’яттю',['../md_docs_2documentation__ua.html#autotoc_md50',1,'']]],
  ['керування_20інвентарем_2',['Керування інвентарем',['../md_docs_2documentation__ua.html#autotoc_md48',1,'']]],
  ['клас_3',['клас',['../md_docs_2documentation__ua.html#autotoc_md39',1,'Character (Базовий клас)'],['../md_docs_2documentation__ua.html#autotoc_md43',1,'Item (Базовий клас)']]],
  ['клас_20game_4',['Клас Game',['../md_docs_2documentation__ua.html#autotoc_md34',1,'']]],
  ['коду_20з_20діаграм_20чи_20відновлення_20діаграм_20з_20коду_20наскільки_20гарно_20та_20правильно_20працюють_20ці_20можливості_5',['7. Чи використовували якісь додаткові можливості інструменту, наприклад генерацію коду з діаграм чи відновлення діаграм з коду? Наскільки гарно та правильно працюють ці можливості?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md115',1,'']]],
  ['коду_20та_20структура_6',['Обсяг коду та структура',['../md_SUMMARY.html#autotoc_md99',1,'']]],
  ['кожному_20типі_20діаграм_20підтримує_20інструмент_20якщо_20ні_20вкажіть_20що_20саме_20не_20підтримується_20та_20для_20якого_20типу_20діаграм_7',['6. Чи всі можливості, доступні на кожному типі діаграм, підтримує інструмент? Якщо ні - вкажіть, що саме не підтримується, та для якого типу діаграм',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md114',1,'']]],
  ['коли_20незрозуміло_20чому_20були_20виконані_20якісь_20дії_20чи_20як_20досягли_20певного_20стану_8',['9. Наскільки зрозумілою була поведінка інструменту в різних ситуаціях? Чи не виникали ситуації, коли незрозуміло, чому були виконані якісь дії чи як досягли певного стану?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md117',1,'']]],
  ['команд_9',['Інтерфейс команд',['../md_docs_2mechanics__ua.html#autotoc_md62',1,'']]],
  ['компоненти_10',['Головні компоненти',['../md_docs_2documentation__ua.html#autotoc_md32',1,'']]],
  ['компонентів_11',['Документація компонентів',['../md_docs_2documentation__ua.html#autotoc_md33',1,'']]],
  ['корисною_20була_20документація_20інструменту_12',['3. Наскільки зрозумілою та корисною була документація інструменту?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md111',1,'']]]
];
