var searchData=
[
  ['обмеження_0',['Відомі обмеження',['../md_docs_2documentation__ua.html#autotoc_md57',1,'']]],
  ['обрано_20саме_20цей_20інструмент_20а_20не_20аналоги_1',['1. Чому було обрано саме цей інструмент, а не аналоги?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md109',1,'']]],
  ['обробка_20помилок_2',['Обробка помилок',['../md_docs_2documentation__ua.html#autotoc_md54',1,'']]],
  ['обсяг_20коду_20та_20структура_3',['Обсяг коду та структура',['../md_SUMMARY.html#autotoc_md99',1,'']]],
  ['огляд_4',['Огляд',['../md_docs_2documentation__ua.html#autotoc_md30',1,'']]],
  ['оновленої_20версій_5',['1. Порівняння попередньої та оновленої версій',['../md_SUMMARY.html#autotoc_md98',1,'']]],
  ['оптимізація_20продуктивності_6',['Оптимізація продуктивності',['../md_docs_2documentation__ua.html#autotoc_md55',1,'']]],
  ['основна_20архітектура_7',['Основна архітектура',['../md_docs_2documentation__ua.html#autotoc_md31',1,'']]],
  ['отримати_20встановити_20налаштувати_20та_20почати_20використовувати_20цей_20інструмент_8',['2. Наскільки просто та зрозуміло було отримати, встановити, налаштувати та почати використовувати цей інструмент?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md110',1,'']]]
];
