var searchData=
[
  ['гарно_20та_20правильно_20працюють_20ці_20можливості_0',['7. Чи використовували якісь додаткові можливості інструменту, наприклад генерацію коду з діаграм чи відновлення діаграм з коду? Наскільки гарно та правильно працюють ці можливості?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md115',1,'']]],
  ['генерацію_20коду_20з_20діаграм_20чи_20відновлення_20діаграм_20з_20коду_20наскільки_20гарно_20та_20правильно_20працюють_20ці_20можливості_1',['7. Чи використовували якісь додаткові можливості інструменту, наприклад генерацію коду з діаграм чи відновлення діаграм з коду? Наскільки гарно та правильно працюють ці можливості?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md115',1,'']]],
  ['головні_20компоненти_2',['Головні компоненти',['../md_docs_2documentation__ua.html#autotoc_md32',1,'']]],
  ['гравець_3',['Player (Гравець)',['../md_docs_2documentation__ua.html#autotoc_md40',1,'']]],
  ['гри_4',['Механіка гри',['../md_docs_2mechanics__ua.html',1,'']]]
];
