var searchData=
[
  ['2_20аналіз_20дотримання_20принципів_20проєктування_0',['2. Аналіз дотримання принципів проєктування',['../md_SUMMARY.html#autotoc_md102',1,'']]],
  ['2_20наскільки_20просто_20та_20зрозуміло_20було_20отримати_20встановити_20налаштувати_20та_20почати_20використовувати_20цей_20інструмент_1',['2. Наскільки просто та зрозуміло було отримати, встановити, налаштувати та почати використовувати цей інструмент?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md110',1,'']]],
  ['2_205_20підтримує_20інструмент_20якщо_20ні_20вкажіть_20які_20саме_20не_20підтримуються_2',['5. Чи всі 14 типів діаграм з UML 2.5 підтримує інструмент? Якщо ні - вкажіть, які саме не підтримуються',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md113',1,'']]]
];
