var searchData=
[
  ['або_20елементи_20керування_20використовувати_20для_20вирішення_20поставлених_20задач_0',['4. Наскільки було зрозуміло, як саме використовувати інструмент, які функції, засоби, вікна або елементи керування використовувати для вирішення поставлених задач?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md112',1,'']]],
  ['аналоги_1',['1. Чому було обрано саме цей інструмент, а не аналоги?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md109',1,'']]],
  ['аналогічну_20задачу_20ще_20раз_2',['13. Що варто було б робити так само, а що змінити, якби довелось виконувати аналогічну задачу ще раз?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md121',1,'']]],
  ['аналіз_20дотримання_20принципів_20проєктування_3',['2. Аналіз дотримання принципів проєктування',['../md_SUMMARY.html#autotoc_md102',1,'']]],
  ['архітектура_4',['Основна архітектура',['../md_docs_2documentation__ua.html#autotoc_md31',1,'']]],
  ['аспекти_20використання_20інструменту_5',['аспекти використання інструменту',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md119',1,'11. Що хорошого можна сказати про цей інструмент, які були позитивні аспекти використання інструменту?'],['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md120',1,'12. Що поганого можна сказати про цей інструмент, які були негативні аспекти використання інструменту?']]],
  ['а_20не_20аналоги_6',['1. Чому було обрано саме цей інструмент, а не аналоги?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md109',1,'']]],
  ['а_20що_20змінити_20якби_20довелось_20виконувати_20аналогічну_20задачу_20ще_20раз_7',['13. Що варто було б робити так само, а що змінити, якби довелось виконувати аналогічну задачу ще раз?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md121',1,'']]]
];
