var searchData=
[
  ['цей_20інструмент_0',['2. Наскільки просто та зрозуміло було отримати, встановити, налаштувати та почати використовувати цей інструмент?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md110',1,'']]],
  ['цей_20інструмент_20а_20не_20аналоги_1',['1. Чому було обрано саме цей інструмент, а не аналоги?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md109',1,'']]],
  ['цей_20інструмент_20які_20були_20негативні_20аспекти_20використання_20інструменту_2',['12. Що поганого можна сказати про цей інструмент, які були негативні аспекти використання інструменту?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md120',1,'']]],
  ['цей_20інструмент_20які_20були_20позитивні_20аспекти_20використання_20інструменту_3',['11. Що хорошого можна сказати про цей інструмент, які були позитивні аспекти використання інструменту?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md119',1,'']]],
  ['ці_20можливості_4',['7. Чи використовували якісь додаткові можливості інструменту, наприклад генерацію коду з діаграм чи відновлення діаграм з коду? Наскільки гарно та правильно працюють ці можливості?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md115',1,'']]]
];
