var searchData=
[
  ['так_20само_20а_20що_20змінити_20якби_20довелось_20виконувати_20аналогічну_20задачу_20ще_20раз_0',['13. Що варто було б робити так само, а що змінити, якби довелось виконувати аналогічну задачу ще раз?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md121',1,'']]],
  ['та_20для_20якого_20типу_20діаграм_1',['6. Чи всі можливості, доступні на кожному типі діаграм, підтримує інструмент? Якщо ні - вкажіть, що саме не підтримується, та для якого типу діаграм',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md114',1,'']]],
  ['та_20зрозуміло_20було_20отримати_20встановити_20налаштувати_20та_20почати_20використовувати_20цей_20інструмент_2',['2. Наскільки просто та зрозуміло було отримати, встановити, налаштувати та почати використовувати цей інструмент?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md110',1,'']]],
  ['та_20корисною_20була_20документація_20інструменту_3',['3. Наскільки зрозумілою та корисною була документація інструменту?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md111',1,'']]],
  ['та_20оновленої_20версій_4',['1. Порівняння попередньої та оновленої версій',['../md_SUMMARY.html#autotoc_md98',1,'']]],
  ['та_20правильно_20працюють_20ці_20можливості_5',['7. Чи використовували якісь додаткові можливості інструменту, наприклад генерацію коду з діаграм чи відновлення діаграм з коду? Наскільки гарно та правильно працюють ці можливості?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md115',1,'']]],
  ['та_20структура_6',['Обсяг коду та структура',['../md_SUMMARY.html#autotoc_md99',1,'']]],
  ['технічна_20документація_7',['Blazing Darkness - Технічна документація',['../md_docs_2documentation__ua.html',1,'']]],
  ['технічні_20деталі_20реалізації_8',['Технічні деталі реалізації',['../md_docs_2documentation__ua.html#autotoc_md49',1,'']]],
  ['типу_20діаграм_9',['6. Чи всі можливості, доступні на кожному типі діаграм, підтримує інструмент? Якщо ні - вкажіть, що саме не підтримується, та для якого типу діаграм',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md114',1,'']]],
  ['типів_20діаграм_20з_20uml_202_205_20підтримує_20інструмент_20якщо_20ні_20вкажіть_20які_20саме_20не_20підтримуються_10',['5. Чи всі 14 типів діаграм з UML 2.5 підтримує інструмент? Якщо ні - вкажіть, які саме не підтримуються',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md113',1,'']]],
  ['типі_20діаграм_20підтримує_20інструмент_20якщо_20ні_20вкажіть_20що_20саме_20не_20підтримується_20та_20для_20якого_20типу_20діаграм_11',['6. Чи всі можливості, доступні на кожному типі діаграм, підтримує інструмент? Якщо ні - вкажіть, що саме не підтримується, та для якого типу діаграм',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md114',1,'']]],
  ['треба_20було_20виконувати_20багато_20надлишкових_20дій_12',['8. Наскільки зручно було використовувати інструмент, чи не треба було виконувати багато надлишкових дій?',['../md_uml_2extra_2lab1d-uml-tool-report_2UML__TOOL__REPORT.html#autotoc_md116',1,'']]]
];
